svalbard/src/test/resources/soap12_envelope.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:fes="http://www.opengis.net/fes/2.0" xmlns:gml="http://www.opengis.net/gml/3.2" xmlns:pubsub="http://www.opengis.net/pubsub/1.0" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsn="http://docs.oasis-open.org/wsn/b-2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <env:Header>
      <wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationProducer/SubscribeRequest</wsa:Action>
   </env:Header>
   <env:Body>
      <wsn:Subscribe>
         <wsn:ConsumerReference>
            <wsa:Address>http://receiver.org/consumer</wsa:Address>
         </wsn:ConsumerReference>
         <wsn:Filter>
            <wsn:MessageContent Dialect="http://www.opengis.net/fes/2.0">
               <fes:Filter>
                  <fes:BBOX>
                     <fes:ValueReference>location</fes:ValueReference>
                     <gml:Envelope srsName="urn:ogc:def:crs:EPSG::4326">
                        <gml:lowerCorner>13.0983 31.5899</gml:lowerCorner>
                        <gml:upperCorner>35.5472 42.8143</gml:upperCorner>
                     </gml:Envelope>
                  </fes:BBOX>
               </fes:Filter>
            </wsn:MessageContent>
         </wsn:Filter>
         <wsn:InitialTerminationTime>2012-09-16T00:00:00Z</wsn:InitialTerminationTime>
         <wsn:SubscriptionPolicy>
         </wsn:SubscriptionPolicy>
         <pubsub:PublicationIdentifier>http://host.org/pubsub/publication/aircraft</pubsub:PublicationIdentifier>
         <pubsub:DeliveryMethod>
            <pubsub:Identifier>http://docs.oasis-open.org/wsn/b-2/NotificationConsumer</pubsub:Identifier>
         </pubsub:DeliveryMethod>
         <pubsub:ContentType>text/xml</pubsub:ContentType>
      </wsn:Subscribe>
   </env:Body>
</env:Envelope>
